$(function(){
    /* ===================================================================================================================
	Плавный скроллинг при переходе на якорь
	==================================================================================================================== */

	// Событие при клике на ссылку-якорь
	$('a[href^="#"]').on('click', function(event) {
	    // отменяем стандартное действие
	    event.preventDefault();
	    
	    // заносим информацию о том, к какому блоку надо перейти
	    var $anchor = $(this).attr("href"),
	    // определяем положение блока на странице
	        anchorPos = $($anchor).offset().top;
	    
	    // Анимация перехода
	    $('html, body').animate({scrollTop: anchorPos}, 500);
  	});



  	/* ===================================================================================================================
	Автоматический верхний отступ блока слайдера на высоту хедера при ширине устройства менее 750px
	==================================================================================================================== */
  	// if($(window).width() <= 750){
  	// 	$('.slider').css('margin-top', $('.header').height());
  	// }



	/* ===================================================================================================================
	Отображение мобильного меню при нажатии на кнопку
	==================================================================================================================== */
	$('.mobile-menu-btn').on('click', function() {
		$('.header .navbar').slideToggle(400);

		// Добавляем класс для изменения цвета фона navbar при открытии мобильного меню
		 $('.header').toggleClass('opacity-7');

		 // Добавляем класс для изменения цвета кнопки при открытии мобильного меню
		 $(this).toggleClass('active');
	});
});